In [51]:
import pandas as pd
import numpy as np

Pandas series

In [52]:
labelsList = ['a','b','c']
num_list = [20,40,45]
numarray = np.array([20,40,45])
dic = {'a':20, 'b':40, 'c':45}

In [53]:
pd.Series(num_list, index=labelsList)

a    20
b    40
c    45
dtype: int64

In [54]:
pd.Series(dic)

a    20
b    40
c    45
dtype: int64

In [55]:
pd.Series(data=labelsList)

0    a
1    b
2    c
dtype: object

In [56]:
pd.Series([sum,print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [57]:
countries = pd.Series([2,4,6,8], index=['CAMEROON','NIGERIA','ETHIOPIA','UGANDA'])
countries

CAMEROON    2
NIGERIA     4
ETHIOPIA    6
UGANDA      8
dtype: int64

In [58]:
countries['CAMEROON']

2

_Working with Pandas DataFarmes_

In [59]:
from numpy.random import randn

In [60]:
np.random.seed(201)

In [61]:
#creating a dataframe
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
B -0.727693  0.430307 -0.686665 -0.453018
C -0.732859 -0.753627 -0.832519  0.449872
D  1.807523 -0.489531  0.881589 -0.698341
E -0.049975  1.907522 -0.327623  1.150032

In [62]:
df['W']

A    0.316783
B   -0.727693
C   -0.732859
D    1.807523
E   -0.049975
Name: W, dtype: float64

In [63]:
type(df['W'])

pandas.core.series.Series

In [64]:
type(df)

pandas.core.frame.DataFrame

In [65]:
df[['W','Z']]

          W         Z
A  0.316783  0.436771
B -0.727693 -0.453018
C -0.732859  0.449872
D  1.807523 -0.698341
E -0.049975  1.150032

In [66]:
#adding culumns
df['Z1'] = df['W'] + df['Y']

In [67]:
df

          W         X         Y         Z        Z1
A  0.316783 -0.493417  1.217946  0.436771  1.534729
B -0.727693  0.430307 -0.686665 -0.453018 -1.414358
C -0.732859 -0.753627 -0.832519  0.449872 -1.565378
D  1.807523 -0.489531  0.881589 -0.698341  2.689112
E -0.049975  1.907522 -0.327623  1.150032 -0.377597

In [68]:
#removing columns
df.drop('Z1', axis=1, inplace=True)

In [69]:
df.drop('E', axis=0)

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
B -0.727693  0.430307 -0.686665 -0.453018
C -0.732859 -0.753627 -0.832519  0.449872
D  1.807523 -0.489531  0.881589 -0.698341

In [70]:
#selecting rows and columns from a dataframe
df.loc['A']

W    0.316783
X   -0.493417
Y    1.217946
Z    0.436771
Name: A, dtype: float64

In [71]:
df.loc['A', 'X']

-0.4934170968496873

In [72]:
df.loc[['A','C'],['X','Y']]

          X         Y
A -0.493417  1.217946
C -0.753627 -0.832519

_using conditional selections_

In [73]:
df > 0

       W      X      Y      Z
A   True  False   True   True
B  False   True  False  False
C  False  False  False   True
D   True  False   True  False
E  False   True  False   True

In [74]:
booleandf = df > 0

In [75]:
booleandf

       W      X      Y      Z
A   True  False   True   True
B  False   True  False  False
C  False  False  False   True
D   True  False   True  False
E  False   True  False   True

In [76]:
df[booleandf]

          W         X         Y         Z
A  0.316783       NaN  1.217946  0.436771
B       NaN  0.430307       NaN       NaN
C       NaN       NaN       NaN  0.449872
D  1.807523       NaN  0.881589       NaN
E       NaN  1.907522       NaN  1.150032

In [77]:
df

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
B -0.727693  0.430307 -0.686665 -0.453018
C -0.732859 -0.753627 -0.832519  0.449872
D  1.807523 -0.489531  0.881589 -0.698341
E -0.049975  1.907522 -0.327623  1.150032

In [78]:
df['W']>0

A     True
B    False
C    False
D     True
E    False
Name: W, dtype: bool

In [79]:
df[df['W']>0]

          W         X         Y         Z
A  0.316783 -0.493417  1.217946  0.436771
D  1.807523 -0.489531  0.881589 -0.698341

_Dealing with Missing Date_

In [80]:
y = {'A':[2,5,np.nan], 'B':[7,np.nan,np.nan],'C':[7,3,9]}

In [81]:
df = pd.DataFrame(y)

In [82]:
df

     A    B  C
0  2.0  7.0  7
1  5.0  NaN  3
2  NaN  NaN  9

In [83]:
df.dropna(axis = 1)

   C
0  7
1  3
2  9

In [84]:
df

     A    B  C
0  2.0  7.0  7
1  5.0  NaN  3
2  NaN  NaN  9

In [85]:
df.dropna(thresh=2)

     A    B  C
0  2.0  7.0  7
1  5.0  NaN  3

In [86]:
df.fillna(value='fill')

      A     B  C
0     2     7  7
1     5  fill  3
2  fill  fill  9

In [87]:
df.fillna(value=df.mean())

     A    B  C
0  2.0  7.0  7
1  5.0  7.0  3
2  3.5  7.0  9

reading data from other sources

In [88]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [89]:
type(df)

list

In [96]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"